class script(object):
    HELP_TXT = """<b>👋 سلام  {} عزیز ❤️ </b>
    
<b>⦿ به بخش راهنمایی ربات خوش آمدید.</b>"""

    CAPTION_TXT = """<b><u>📚راهنمای تنظیم کاپشن فایل :</u></b>
    
<b><u>⦿ تنظیم کپشن خودکار برای فایل ها: </u></b>
برای اینکه بتوانید کپشن برای فایل هاتون ایجاد کنید ابتدا دستور /set_caption سپس چیزی که میخواستید کپشن فایل بشه را تایپ می‌کنید مانند 
/set_caption test

 <b><u>⦿حذف کپشن: </u></b>
برای حذف کپشن دستور /del_caption به ربات ارسال کنید.

<b><u>⦿ نمایش کپشن ذخیره شده : </u></b>
برای نمایش دادن کپشن ذخیره شده شما
دستور /set_caption را ارسال کنید."""
   
    THUMBNAIL_TXT = """<b><u>📚راهنمای تنظیم عکس بندانگشتی فایل :</u></b>
    
<b><u>⦿ ثبت عکس تامبینل برای فایل ها: </u></b>
عکس تامبینل یعنی عکسی که اول فایل های ویدیوی نمایش داده میشه.
برای ثبت عکس تامبینل یک عکس با فرمت png یا jpg به ربات ارسال کنید.

<b><u>⦿ حذف عکس تامبینل :</u></b>
برای حذف عکس دستور /delthumb به ربات ارسال کنید.

<b><u>⦿ نمایش عکس بندانگشتی ذخیره شده :</u></b>
برای نمایش عکس بندانگشتی ذخیره شده 
دستور /viewthumb را ارسال کنید."""

    ABOUT_TXT = """<b>🤖 My Name :</b> <a href='https://t.me/IR_RenameBot'>Rename Bot2.0</a>
<b>📝 Language :</b> <a href='https://python.org'>Python 3</a>
<b>📢 Channel :</b> <a href='https://t.me/IR_BOTZ'>IR-BOTZ</a>
<b>🧑‍💻 Developer :</b> <a href='https://t.me/farshidband'>FB</a>
"""

    DONATE_TXT = """
<b>🥲 Thanks For Showing Interest In Donation! ❤️</b>

If You Like My Bots & Projects, You Can 🎁 Donate Me Any Amount From 10 Rs Upto Your Choice.

<b>🛍 UPI ID:</b> <code>FARSHIDB</code> 

<b>📸 Send Screenshot After Donation To Activate Your Premium Plan </b> """

    ADMIN_TXT = """<b><u>⦿ دستورات ربات فقط در اختیار ادمین</u></b>

<b>⦿ /users - تعداد کاربران </b>
<b>⦿ /allids - آیدی کاربران ربات </b>
<b>⦿ /broadcast - پیام همگانی به کاربران </b>
<b>⦿ /warn - پیام به کاربر</b>
<b>⦿ /resetpower - ریست محدودیت حجمی کاربر</b>
<b>⦿ /ceasepower - ایجاد محدودیت حجمی برای کاربر</b>
<b>⦿ /addpremium - ارتقا کاربران</b>
<b>⦿ /restart - ریست ربات</b>"""





